

#include <iostream>
using namespace std;
int main()
{
	int n;
	cin >> n;
	int number1, number2;
	int sum = 0;
	double av = 0.0;
	bool contains = true;// булева променлива, която проверява дали едното число съдържа другото, тя променя стойността си при всяка проверка на 2 числа
	bool flag = false; // булева променлива, която става истина ако види съсържащо се число и пази стойността си
	cin >> number1;// Въвеждаме първото число еднократно, след това в цикъла въвеждаме само второто, а накрая първото става предишното второ
	sum = number1;
	for (int i = 0; i < n - 1; i++)
	{
		cin >> number2;
		sum += number2;
		int n1copy = number1; // правим си две копия за да запазим числата, и да зададем на първото стойността на второто накрая
		int n2copy = number2;
		while (n1copy > 0)// докато първото ни число е >0 ще проверяваме дали не съдържа второто
		{
			contains = true; // по подразбиране задаваме булевата променлива, че го съдържа
			while (n2copy != 0)// минаваме по всяка една цифра на второто и проверяваме 1ва цифра на 1то число с 1ва цифра на второто число, след това 2ра цифра на 1то число с 2ра цифра на 2то число, и така докато не минем всички цифри на второто число
			{
				if (n2copy % 10 != n1copy % 10) //проверяваме последните цифри на числата
				{
					contains = false;// ако срещбен една различна, прекратяваме цикъла, защото няма смисъл да проверяваме за еднаквост повече
					break;
				}
				n2copy /= 10;
				n1copy /= 10;// премахваме последната цифра и на двете числа
			}
			if (contains)// ако съдържа си правим флага, истина и брейкваме
			{
				flag = true;
				break;
			}
			n1copy /= 10; // премахваме последната цифра на първото число

		}

		number1 = number2; // както се разбрахме на 14 ред, следващото първо число е сегашното второ.
	}
	av = sum * 1.0 / n; // от тук надолу е твоята логика
	if (flag == true)
	{
		cout << "yes\n" << av;
	}
	else
	{
		cout << "no";
	}
	return 0;
}

